#include <bits/stdc++.h>
using namespace std;
int main()
{
    int i, j, k = 0;
    int n;
    cin >> n >> i >> j >> k;
    for (i = n / 2; i <= n; i++) // একটি লুপ চলছে n/2 থেকে n পর্যন্ত -> কমপ্লেক্সিটি O(N/2) = O(N) [ আমরা কন্সট্যান্ট বাদ দিয়ে কমপ্লেক্সিটি বের করি ]

    {

        for (j = 2; j <= n; j *= 2) // একটি লুপ চলছে 2 থেকে n পর্যন্ত এবং প্রতিবার দ্বিগুণ হচ্ছে -> কমপ্লেক্সিটি O(log2N) = O(logN) [ আমরা কন্সট্যান্ট বাদ দিয়ে কমপ্লেক্সিটি বের করি ]

        {

            k = k + n / 2;
        }
    }

    // টোটাল কমপ্লেক্সিটি O(N) * O(logN) = O(NlogN) [ কারন একটি লুপ আরেকটি লুপের ভিতরে আছে নেস্টেড আকারে ]
    return 0;
}